//-------------------------------------------------------------------------------------------------
//AppSdk.h
//-------------------------------------------------------------------------------------------------

#ifndef _APP_SDK_H_
#define _APP_SDK_H_

#define APP_SDK_EXPORTS

#ifdef APP_SDK_EXPORTS
#define APP_SDK_API __declspec(dllexport)
#else
#define APP_SDK_API __declspec(dllimport)
#endif

//-------------------------------------------------------------------------------------------------
//全局错误码定义
//-------------------------------------------------------------------------------------------------
#define APP_SDK_NOERROR 				0	//没有错误
#define APP_SDK_INIT_ERROR			   -1	//API初始化错误
#define APP_SDK_AIS_ERROR			   -2	//AIS数据提取错误

//-------------------------------------------------------------------------------------------------
//结构体定义
//-------------------------------------------------------------------------------------------------
//报警设备信息
typedef struct
{
	int nIndex;						//序号
	int nPort;						//端口
	char sDeviceIP[16];				//IP地址
} APP_SDK_ALARMER;

//-------------------------------------------------------------------------------------------------
//API函数定义
//-------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------
//初始化
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
extern "C" APP_SDK_API int __stdcall APP_SDK_Init(void);

//-----------------------------------------------------------------------------
//释放
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
extern "C" APP_SDK_API int __stdcall APP_SDK_Cleanup(void);

//-----------------------------------------------------------------------------
//数据回调函数(服务端，客户端共用)
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
typedef void(*fNetRecvCallBack)(APP_SDK_ALARMER *pAlarmer, char *buffer, unsigned int dwSize);
extern "C" APP_SDK_API int __stdcall APP_SDK_NET_SetRecvCallBack(fNetRecvCallBack cbNetcallback);

//-----------------------------------------------------------------------------
//客户端登录
//char *sIPAddr     [in] sIPAddr   服务端IP地址，例如:"192.168.1.64"
//int nPort         [in] nPort     服务端端口，例如: 5678   
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
extern "C" APP_SDK_API int __stdcall APP_SDK_NET_ClientLogin(char *sIPAddr, int nPort);

//-----------------------------------------------------------------------------
//客户端登出
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
extern "C" APP_SDK_API int __stdcall APP_SDK_NET_ClientLogout(void);

//-----------------------------------------------------------------------------
//客户端发送数据
//char *sBuffer  [in] sBuffer    发送的数据
//int  nSize     [in] nSize      数据的长度
//return:         APP_SDK_NOERROR
//-----------------------------------------------------------------------------
extern "C" APP_SDK_API int __stdcall APP_SDK_NET_ClientDataSend(int nLoginID, char *sBuffer, int nSize);

#endif  //

